/***********************************************************************
 * Name: Anton Parkhomenko
 * NetID: parkhomenko.av
 * Precept: week 02
 *
 * Опис: Напишіть програму ArithmeticProgression, яка обраховує суму перших 
 * десяти додатніх чисел, 1+2+3+...+10. 
 *
 * Суму обрахуйте двома шляхами:
 *
 * 1. шляхом додавання 10 змінних , в які 
 * зазделегідь розміщено кожне число від 1 до 10. Суму зберігти у змінну із
 * іменем sum1. Використайте для збереженя чисел десять змінних типу int, із 
 * різними іменами (наприклад, x1, x2, ... x10). 
 *
 * 2. за допомогою формули арифметичної прогресії: S=N(x1+xN)/2, де  
 * x1 — перший член арифметичної прогресії,  xN— останній член прогресії,
 * N- номер останнього члену, тобто загальна кількість членів прогресії,
 * що додаються. В цьому випадку створіть необхідні змінні для збереження 
 * всіх параметрів, зазначених у формулі.
 *
 * Результат роботи прогрма має вивести у дві строки, зазначаючи яким
 * чином була обрахована сума (для виводу другої строки використовуйте
 * операцію конкатенації, підставляючи фактичні значення, що зберігаються у
 * відповідних змінних x1,xn,n):
 *
 * > java ArithmeticProgression 
 * Сума обрахована шляхом додавання 10 змінних дорівнює 55
 * Сума обрахована за формулою S=n(x1+xn)/2 (де x1=1, xn=10, n=10) дорівнює 55
 *************************************************************************/

public class ArithmeticProgression {
    public static void main(String[] args) {

        // 0-ий варіант розрахунку
        // декларування всіх змінних та присвоєння відповідних значень
        int lastNumber=10, sum = 0;
        // обрахунок суми
        for(int i=1; i<=lastNumber; i++) sum +=i;
        // вивід суми у консоль
        System.out.println("0. Сума обрахована циклом дорівнює " + sum);

        // 1-ий варіант розрахунку
        // декларування всіх змінних та присвоєння відповідних значень
        int x1=1,x2=2,x3=3,x4=4,x5=5,x6=6,x7=7,x8=8,x9=9,x10=10,sum1=0;
        // обрахунок суми
        sum1=x1+x2+x3+x4+x5+x6+x7+x8+x9+x10;
        // вивід суми у консоль
        System.out.println("1. Сума обрахована шляхом додавання 10 змінних дорівнює " + sum1);


        // 2-ий варіант розрахунку (за формулою)
        // декларування всіх змінних та присвоєння відповідних значень
        int sum2 = 0, n=10;
        // обрахунок суми
        sum2 = n * (x1+x10) / 2;
        // вивід суми у консоль
        System.out.println("2. Сума обрахована за формулою S=n(x1+xn)/2 (де x1=1, xn=10, n=10) дорівнює " + sum1);

    }
}